export function ImportantInfo() {
  return (
    <section className="bg-[#F8FAFC] pb-24 px-6">
      <div className="max-w-4xl mx-auto bg-[#FEFCE8] border border-[#FEF08A] rounded-3xl p-8 md:p-10 transition-shadow duration-300 hover:shadow-md">
        <h3 className="font-bold text-lg mb-4 text-gray-900">
          Важная информация
        </h3>
        <p className="text-[14px] text-gray-700 leading-relaxed">
          <strong>FindDoctor.kz</strong> не является медицинской организацией.
          Мы предоставляем платформу для размещения информации о врачах. Вся
          ответственность за качество услуг лежит на врачах и медицинских
          учреждениях. В соответствии с условиями Договора и его приложений, мы
          лишь оказываем Врачам услуги по оформлению и размещению их Материалов
          на нашем Сайте на основании предоставленной врачами необходимой
          информации, с целью привлечения потенциальных Клиентов. Кроме того, в
          согласии с ОСОБЫМИ УСЛОВИЯМИ ДОГОВОРА с врачами: Врач гарантирует, что
          осуществляет деятельность на законных основаниях и имеет в наличии
          действующие необходимые лицензии, сертификаты, разрешения и иные
          документы, требуемые законодательством для осуществления медицинской
          (стоматологической) деятельности. Также врач гарантирует
          предоставление достоверной информации для размещения Материалов на
          Сайте и самостоятельно несет перед клиентами гражданско-правовую,
          административную, уголовную и иную ответственность, предусмотренную
          законодательством Республики Казахстан.
        </p>
      </div>
    </section>
  );
}
